{"index":{"title":"index","links":[],"tags":[],"content":"GK Consulting §\nExpert DevOps And Software Architecture Consulting §\nOur Expertise §\nWell architected software and robust infrastructure are critical to a technology platform’s success, and we’re here to ensure you’re on the right track. We’ll help you plan, implement, and manage your resources, making sure every step is secure and efficient.\n\n\n                  \n                  Info \n                  \n                \nContact us by email at hello@gkconsulting.dev for a free consultation.\n\nWhat We Offer §\nTrusted Leadership: Think of us as your trail guides to your future. Our solutions seamlessly blend timeless principles with cutting-edge technology, ensuring your infrastructure journey is both guided and innovative.\nScaling Heights with Terraform: Ascend confidently with our Terraform expertise. We’ll help you scale your resources smoothly, so you can avoid the classic IaC pitfalls.\nBackend Excellence: Our backend architects construct frameworks that provide stability and performance, helping you overcome any technological challenges that come your way.\nSubcontracting: Need extra capacity for a project? We can partner with your team to ensure your project completes on time.\nOur Process §\n\nFirst, we’ll have a free consultation with you to understand what you’re looking for and how we can help.\nOnce you’re ready to start things with us we will review your current architecture and your technological landscape. This is our GPS device, so we agree on where you’re at.\nNext, we’ll develop a plan to navigate to you where you want to go, charting around the business and technical requirements that you have.\nLastly, we can either implement the plan, or partner with your internal team implement it - we’re happy with whatever is better for you.\n\nWorking With Us §\nWhat do our clients say about working with us?\nMike L. from TIFIN AMP kindly says:\n\nWe contracted with GK Consulting to architect our infrastructure management and were met with an exceptional experience. Their team, a blend of professionalism and expertise, delivered insights that have become the bedrock of our ongoing infrastructure management.\nCommunication with GK was seamless, making complex technical discussions enlightening and productive. They provided a detailed project plan for the engagement and left us with an extremely polished work product at the end.\nThank you, GK Consulting, for setting us up for success. Your service is a solid five stars; highly recommended!”\n\nReady to discuss further? §\nDrop us a message at hello@gkconsulting.dev for a free consultation - we look forward to partnering with you."},"resume":{"title":"resume","links":[],"tags":[],"content":"Resume - GK Consulting §\nYou wouldn’t hire an engineer without vetting them, why should your vendors be an exception?\nTools, Technology, Skills §\nTools and technologies we love working with, non-exhaustive for brevity. We’re comfortable working with similar tools in these categories as well.\nDevOps and Infrastructure §\n\nInfrastructure as Code (IaC)\n\nTerraform\nPulumi\nAnsible\n\n\nContainer Orchestration and Containerization\n\nKubernetes\nECS\nDocker\ncri-o\nPodman\n\n\nCloud-Native Tools\n\nPrometheus\nGrafana\nAlertManager\nCertManager\nMetalLB\nArgoCD\netc.\n\n\nVCS Tools\n\nGitLab\nGitHub\n\n\nCI Systems\n\nCircleCI\nGitHub Actions\nGitLab CI\nTekton\n\n\nPublic Cloud\n\nAmazon Web Services (AWS)\nGoogle Cloud Platform (GCP)\n\n\nVirtual Private Server Providers (VPS’s)\n\nVultr\nLinode\n\n\nColocation Providers\n\nIron Mountain\nDigital Realty\n\n\nPrivate Cloud\n\nOpenStack\nVMWare\nProxMox\n\n\n\nSoftware Development §\n\nPython\nGo\nRust\nDjango\nNodeJS\nReactJS\nTypeScript\nRedux\n\nExperience §\nOur engineers have decades of combined software development and DevOps/Infrastructure experience. We’ve worked with Fortune 500 companies such as Hewlett Packard Enterprise (HPE) and Pacific Gas and Electric (PG &amp; E), as well as early stage startups!\nExamples of completed work for such companies (among others), below.\n\nMigrate applications from Elastic Beanstalk to ECS\nMigrate applications from Firebase to Kubernetes\nImplement day-one Kubernetes for new applications\nCodify public cloud infrastructure with IaC tools\nRefactor IaC repositories\nCreate reproducible development environments with IaC tools\nCreate CI an IaC pipelines\nCreate backend API’s, integrating with existing client applications\nCreate cloud-based network solutions to connect on-prem and cloud resources\nCreate automated, local development workflows\nPerform upgrades for client applications (such as upgrading NodeJS or Python)\nCreate automation for provisioning physical servers, storage, and networking with Virtual Machines or Kubernetes Nodes\n\nEducation §\nAll of our engineers possess a minimum of a Bachelor of Computer Science degree from acclaimed public universities, where they additionally participated in graduate research programs."}}